#language: ru

@rickMortyAPI

  Функция: Изучения персонажей сериала Rick and Morty
    Сценарий: Сравнение расы и местоположения персонажей с Morty

      Если получить и сохранить информацию о расе и местоположении Morty Smith
      И получить последний эпизод где появлялся Morty
      И в эпизоде найти последнего появлявшегося персонажа
      И сохранить информацию о его расе и местоположении
      Тогда проверить совпадение расы персонажей
      И проверить несовпадение локаций персонажей


